{
    "USBDriveDataDir": "When a USB drive is connected to Ember, print data files are expected to be in this folder.",
    "DownloadDir": "The folder to which files are downloaded.  Used for automated testing, there should be no need to change this setting.",
    "StagingDir": "The folder in which print data files are staged.  Used for automated testing, there should be no need to change this setting.",
    "PrintDataDir": "The folder that contains printable data.  Used for automated testing, there should be no need to change this setting.",
    "HardwareRev": "Set to 0 for pre-production (Anas-series) Embers, otherwise there should be no need to change this setting.",
    "LayerExtraSec": "Extra time to add per layer to provide better estimates of remaining print time.",
    "MaxTemperatureC": "The maximum temperature (measured at the main PCB) at which printing is allowed.",
    "InspectionHeightMicrons": "The height by which the build head is raised for inspection (provided there’s enough headroom) when the user pauses a print.",
    "MaxZTravelMicrons": "Used to help determine if there’s enough headroom to lift the build head for inspection.  Should not be changed unless the dimensions of Ember itself are changed.",
    "DetectJams": "Set to 1 to enable jam detection, to 0 to disable it.",
    "MotorTimeoutScaleFactor": "Amount by which calculated expected times for motor movements are multiplied, in order to provide a timeout safety factor.  May need to be increased if max jerk settings are reduced.",
    "MinMotorTimeoutSec": "Amount added to (scaled) expected times for motor movements, in order to provide a timeout safety margin.  May need to be increased if max jerk settings are reduced.",
    "ProjectorLEDCurrent": "Sets the PWM factor from 0 to 100% (for values of 0-255) to control the current through the projector’s UV LED.  Set to -1 and restart the printer to revert to the original factory setting.",
    "MicroStepsMode": "Sets the microstepping mode for both the Z axis and tray rotation motors.   1 = full step, 2 = half step, ..., 6 = 1/32 step..",
    "ZStepAngleMillidegrees": "The angle through which the Z-axis stepper motor moves for a single step.  Should not be changed unless the stepper motor itself is changed.",
    "ZMicronsPerMotorRev": "The number of microns of Z-axis travel for a single rotation of the Z-axis stepper motor, i.e. the pitch of the lead screw for a 1:1 gear ratio.  Should not be changed unless the lead screw or gear ratio is changed.",
    "ZMicroStepsMode": "No longer used.  Separate Z and R values replaced by single MicroStepsMode setting in version 2.1.",
    "RStepAngleMillidegrees": "The angle through which the tray rotation stepper motor moves for a single step.  Should not be changed unless the stepper motor itself is changed.",
    "RMilliDegreesPerMotorRev": "The amount of tray rotation for a single rotation of the stepper motor that controls it (with 2:1 gear ratio).  Should not be changed unless that gear ratio is changed.",
    "RMicroStepsMode": "No longer used.  Separate Z and R values replaced by single MicroStepsMode setting in version 2.1.",
    "ZHomingJerk": "The maximum jerk value allowed when homing on the Z axis.",
    "ZHomingSpeedMicronsPerSec": "The speed at which the build plate moves upwards when homing.",
    "RHomingJerk": "The maximum jerk value allowed when homing the resin tray.",
    "RHomingSpeedRPM": "The speed at which the resin tray rotates to the home position.",
    "RHomingAngleMilliDegrees": "The angle through which the resin tray rotates back to the home position (after hitting the homing sensor on a clockwise rotation).  Should not be changed unless the dimensions of Ember itself are changed.",
    "ZStartPrintJerk": "The maximum jerk value allowed when moving the build head down to the calibration/start print position.",
    "ZStartPrintSpeedMicronsPerSec": "The speed at which the build head moves down to the calibration/start print position.",
    "ZStartPositionMicrons": "How far the build head moves down to the calibration/start print position.   Should not be changed unless the dimensions of Ember itself are changed.",
    "RStartPrintJerk": "The maximum jerk value allowed when rotating the resin tray to the calibration/start print position.",
    "RStartPrintSpeedRPM": "The speed at which the resin tray is rotated to the calibration/start print position.",
    "RStartPrintPositionMillidegrees": "How far the resin tray is rotated to reach the calibration/start print position.  Should not be changed unless the dimensions of Ember itself are changed.",
    "FrontPanelScreenSaverMinutes": "How many minutes must pas between front panel button presses before its OLED screen will be put to sleep (to help prevent burn-in).  Set to 0 to have the screen never sleep.",
    "ImageScaleFactor": "Factor by which to multiply the size of each video mode slice image, in order to correct for projector positional error.  Used in video mode only.",
    "PatternModeImageScaleFactor": "Factor by which to multiply the size of each pattern mode slice image, in order to correct for projector positional error.  Used in pattern mode only.",
    "FirmwareVersion": "Used to detect when default values of selected printer settings need to be updated to those of the latest firmware version.",
    "JobName": "The name of the print job displayed on the front panel.  Set when print data is loaded and cleared when print data is cleared.",
    "UserName": "The name of the user displayed on the front panel.  Set when print data is loaded and cleared when print data is cleared.",
    "JobID": "The job ID (if any) provided by the Spark server.  Set when a job is loaded directly from the server and cleared when that job has completed.",
    "PrintFile": "The name of the print data file currently loaded.  Set when a job is loaded and cleared when print data is cleared.",
    "LayerThicknessMicrons": "The amount by which the build head moves up for each layer.",
    "FirstExposureSec": "The exposure time for the first layer.",
    "BurnInLayers": "The number of layers for which the burn-in settings apply.",
    "BurnInExposureSec": "The exposure time for the burn-in layers.",
    "ModelExposureSec": "The exposure time for the model layers (all layers after the burn-in layers).",
    "RotateHomeOnApproach": "When set to a non-zero value, the resin tray rotates until the homing sensor is tripped on approach, instead of using the …RotationMilliDegrees values.  This may prevent drift in tray position on partial jams, but may not work for low rotation jerk values.",
    "UsePatternMode": "When set to a non-zero value, the projector is put into pattern mode (only on first loading the print data file and at startup).  A rectangle at 45° in the center of each slice image is mapped into pattern mode before being sent to the projector.",
    "FirstSeparationRotJerk": "Determines acceleration/deceleration with which the rotation arm slides away from the build area.",
    "FirstSeparationRPM": "Velocity at which the rotation arm slides away from the build area.",
    "FirstApproachRotJerk": "Determines acceleration/deceleration with which the rotation arm slides towards the build area.",
    "FirstApproachRPM": "Velocity at which the rotation arm slides towards the build area.",
    "FirstZLiftMicrons": "The distance the build head overlifts each layer, to allow trapped air out and fresh resin in.",
    "FirstSeparationZJerk": "Determines acceleration/deceleration with which the z-axis moves up out of the deeper channel.",
    "FirstSeparationMicronsPerSec": "Velocity at which the build head moves up out of the deeper channel.",
    "FirstApproachZJerk": "Determines acceleration/deceleration with which the z-axis moves down back to the build area.",
    "FirstApproachMicronsPerSec": "Velocity at which the z-axis moves back down to the build area.",
    "FirstRotationMilliDegrees": "How far the resin tray is rotated on separation and approach.",
    "FirstExposureWaitMS": "No longer used.",
    "FirstSeparationWaitMS": "No longer used.",
    "FirstApproachWaitMS": "Time to pause before exposure.",
    "FirstPressMicrons": "The distance the build head presses down the resin tray.",
    "FirstPressMicronsPerSec": "The velocity at which the build head presses down the resin tray.",
    "FirstPressWaitMS": "Time to pause after pressing down the resin tray.",
    "FirstUnPressMicronsPerSec": "The velocity at which the build head moves back up after pressing down the resin tray",
    "BurnInSeparationRotJerk": "Determines acceleration/deceleration with which the rotation arm slides away from the build area.",
    "BurnInSeparationRPM": "Velocity at which the rotation arm slides away from the build area.",
    "BurnInApproachRotJerk": "Determines acceleration/deceleration with which the rotation arm slides towards the build area.",
    "BurnInApproachRPM": "Velocity at which the rotation arm slides towards the build area.",
    "BurnInZLiftMicrons": "The distance the build head overlifts each layer, to allow trapped air out and fresh resin in.",
    "BurnInSeparationZJerk": "Determines acceleration/deceleration with which the z-axis moves up out of the deeper channel.",
    "BurnInSeparationMicronsPerSec": "Velocity at which the build head moves up out of the deeper channel.",
    "BurnInApproachZJerk": "Determines acceleration/deceleration with which the z-axis moves down back to the build area.",
    "BurnInApproachMicronsPerSec": "Velocity at which the z-axis moves back down to the build area.",
    "BurnInRotationMilliDegrees": "How far the resin tray is rotated on separation and approach.",
    "BurnInExposureWaitMS": "No longer used.",
    "BurnInSeparationWaitMS": "No longer used.",
    "BurnInApproachWaitMS": "Time to pause before exposure.",
    "BurnIntPressMicrons": "The distance the build head presses down the resin tray.",
    "BurnInPressMicronsPerSec": "The velocity at which the build head presses down the resin tray.",
    "BurnInPressWaitMS": "Time to pause after pressing down the resin tray.",
    "BurnInUnPressMicronsPerSec": "The velocity at which the build head moves back up after pressing down the resin tray",
    "ModelSeparationRotJerk": "Determines acceleration/deceleration with which the rotation arm slides away from the build area.",
    "ModelSeparationRPM": "Velocity at which the rotation arm slides away from the build area.",
    "ModelApproachRotJerk": "Determines acceleration/deceleration with which the rotation arm slides towards the build area.",
    "ModelApproachRPM": "Velocity at which the rotation arm slides towards the build area.",
    "ModelZLiftMicrons": "The distance the build head overlifts each layer, to allow trapped air out and fresh resin in.",
    "ModelSeparationZJerk": "Determines acceleration/deceleration with which the z-axis moves up out of the deeper channel.",
    "ModelSeparationMicronsPerSec": "Velocity at which the build head moves up out of the deeper channel.",
    "ModelApproachZJerk": "Determines acceleration/deceleration with which the z-axis moves down back to the build area.",
    "ModelApproachMicronsPerSec": "Velocity at which the z-axis moves back down to the build area.",
    "ModelRotationMilliDegrees": "How far the resin tray is rotated on separation and approach.",
    "ModelExposureWaitMS": "No longer used.",
    "ModelSeparationWaitMS": "No longer used.",
    "ModelApproachWaitMS": "Time to pause before exposure.",
    "ModeltPressMicrons": "The distance the build head presses down the resin tray.",
    "ModelPressMicronsPerSec": "The velocity at which the build head presses down the resin tray.",
    "ModelPressWaitMS": "Time to pause after pressing down the resin tray.",
    "ModelUnPressMicronsPerSec": "The velocity at which the build head moves back up after pressing down the resin tray"
  }
